erp3l/src/Catalogs/НастройкиПериодическихОпераций/НастройкиПериодическихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПериодическихОпераций</name>
  <basedOn>Catalog.НастройкиПериодическихОпераций</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипПериодическихПлатежей</name>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагентаДепозитный</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЛимита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаОснование</name>
    <type>
      <types>CatalogRef.НастройкиПериодическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПроцентов</name>
    <type>
      <types>CatalogRef.СпособыРасчетаСуммПериодическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизацииДепозитный</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭффективнаяПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяСуммаСделки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяСуммаСделки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодическиеОперации</name>
    <attributes>
      <name>НомерПериодическойОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВидОперации</name>
      <type>
        <types>CatalogRef.УдалитьВидыОперацийБюджетирование</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчета</name>
      <type>
        <types>CatalogRef.СпособыРасчетаГрафиковПериодическихОпераций</types>
        <types>CatalogRef.СпособыРасчетаСуммПериодическихОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеЗначения</name>
      <type>
        <types>EnumRef.СпособыИспользованияЗначенияПериодическойОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
        <types>CatalogRef.СтатьиДвиженияРесурсов</types>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетОрганизации</name>
      <type>
        <types>DefinedType.БанковскийСчетОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаСумм</name>
      <type>
        <types>CatalogRef.СпособыРасчетаСуммПериодическихОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента</name>
      <type>
        <types>DefinedType.БанковскийСчетКасса</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидБюджета</name>
      <type>
        <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОперацииФИ</name>
      <type>
        <types>EnumRef.ТипыОперацийГрафикаФинансовыхИнструментов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикиОпераций</name>
    <attributes>
      <name>НомерОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВидОперации</name>
      <type>
        <types>CatalogRef.УдалитьВидыОперацийБюджетирование</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчета</name>
      <type>
        <types>CatalogRef.СпособыРасчетаГрафиковПериодическихОпераций</types>
        <types>CatalogRef.СпособыРасчетаСуммПериодическихОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>БазаДляРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяЗадолженность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетОрганизации</name>
      <type>
        <types>DefinedType.БанковскийСчетОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента</name>
      <type>
        <types>DefinedType.БанковскийСчетКонтрагента</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
        <types>CatalogRef.СтатьиДвиженияРесурсов</types>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НакопленныйПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидБюджета</name>
      <type>
        <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОперацииФИ</name>
      <type>
        <types>EnumRef.ТипыОперацийГрафикаФинансовыхИнструментов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/НастройкиПериодическихОпераций/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ЗаполнитьПоДоговоруКонтрагента();
	КонецЕсли;
	
	УстановитьВидимость();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.НастройкаОснование.Видимость=ЗначениеЗаполнено(Объект.НастройкаОснование);	
	
	Элементы.ДатаОкончания.Доступность=НЕ Объект.Бессрочный;
	
	Элементы.СуммаЛимита.Видимость=НЕ Объект.ТипПериодическихПлатежей=Перечисления.ВидыФинансовыхИнструментов.РасчетыСКонтрагентами;	
	
	
КонецПроцедуры // УстановитьВидимость() 

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	
	Если Объект.Бессрочный Тогда
		
		Объект.ДатаОкончания="";
		
	КонецЕсли;
	
	УстановитьВидимость();
			
КонецПроцедуры

&НаКлиенте
Процедура ГрафикиОперацийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элементы.ГрафикиОпераций.ТекущиеДанные.СчетОрганизации	= СчетОрганизации;
	Элементы.ГрафикиОпераций.ТекущиеДанные.СчетКонтрагента	= СчетКонтрагента;
	Элементы.ГрафикиОпераций.ТекущиеДанные.Валюта			= Объект.Валюта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодическиеОперацииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элементы.ПериодическиеОперации.ТекущиеДанные.СчетОрганизации	= СчетОрганизации;
	Элементы.ПериодическиеОперации.ТекущиеДанные.СчетКонтрагента	= СчетКонтрагента;
	Элементы.ПериодическиеОперации.ТекущиеДанные.Валюта				= Объект.Валюта;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьГрафик(Команда)
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("Валюта",Объект.Валюта);
	СтруктураПараметров.Вставить("СпособРасчетаПроцентов",	Объект.СпособРасчетаПроцентов);
	СтруктураПараметров.Вставить("СчетОрганизации",			СчетОрганизации);
	СтруктураПараметров.Вставить("СчетКонтрагента",			СчетКонтрагента);
	СтруктураПараметров.Вставить("ИдентификаторРодителя",ЭтаФорма.УникальныйИдентификатор);
	
	ОткрытьФорму("Справочник.НастройкиПериодическихОпераций.Форма.ФормаЗагрузкаГрафиковОпераций",СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьРезультатЗагрузкиГрафика(АдресЗагруженныхДанных)
	
	ДанныеЗагрузки=ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	СтруктураПоиска=Новый Структура;
	СтруктураПоиска.Вставить("ВидОперации",	ДанныеЗагрузки.ВидОперации);
	СтруктураПоиска.Вставить("Валюта",		ДанныеЗагрузки.Валюта);
	
	Если ЗначениеЗаполнено(ДанныеЗагрузки.СпособРасчета) Тогда
		
		СтруктураПоиска.Вставить("СпособРасчета",ДанныеЗагрузки.СпособРасчета);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗагрузки.СчетОрганизации) Тогда
		
		СтруктураПоиска.Вставить("СчетОрганизации",ДанныеЗагрузки.СчетОрганизации);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗагрузки.СчетКонтрагента) Тогда
		
		СтруктураПоиска.Вставить("СчетКонтрагента",ДанныеЗагрузки.СчетКонтрагента);
		
	КонецЕсли;
	
	Если ДанныеЗагрузки.ОчищатьПредыдущиеЗначения Тогда
		
		СтрокиКУдалению=Объект.ГрафикиОпераций.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого Строка Из СтрокиКУдалению Цикл
			
			Объект.ГрафикиОпераций.Удалить(Строка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураПоиска.Вставить("СтатьяБюджета",ДанныеЗагрузки.СтатьяБюджета);
	
	Для Каждого Строка ИЗ ДанныеЗагрузки.ТаблицаГрафика Цикл
		
		НоваяСтрока=Объект.ГрафикиОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураПоиска);
		
	КонецЦикла;
	
	Объект.ГрафикиОпераций.Сортировать("ДатаОперации Возр");
	
КонецПроцедуры // ПолучитьРезультатЗагрузкиГрафика() 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ЗагруженГрафикОпераций" Тогда
		
		ПолучитьРезультатЗагрузкиГрафика(Параметр);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодическиеОперацииДатаНачалаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Элементы.ПериодическиеОперации.ТекущиеДанные.ДатаОкончания)
		ИЛИ Элементы.ПериодическиеОперации.ТекущиеДанные.ДатаОкончания<Элементы.ПериодическиеОперации.ТекущиеДанные.ДатаНачала
		ИЛИ Элементы.ПериодическиеОперации.ТекущиеДанные.ИспользованиеЗначения=ПредопределенноеЗначение("Перечисление.СпособыИспользованияЗначенияПериодическойОперации.РазоваяОперация") Тогда
		
		Элементы.ПериодическиеОперации.ТекущиеДанные.ДатаОкончания=Элементы.ПериодическиеОперации.ТекущиеДанные.ДатаНачала;
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьГрафик(Команда)
	
	РассчитатьГрафикНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьГрафикНаСервере()
	
	НастройкаОбъект=РеквизитФормыВЗначение("Объект");
	Объект.ГрафикиОпераций.Очистить();
	
	ТаблицаГрафика=Справочники.НастройкиПериодическихОпераций.ПолучитьТаблицуГрафикаОпераций(НастройкаОбъект);
	
	Для Каждого Строка ИЗ ТаблицаГрафика Цикл
		
		НоваяСтрока=Объект.ГрафикиОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		
	КонецЦикла;
	
КонецПроцедуры // РассчитатьГрафикНаСервере()

&НаКлиенте
Процедура ПериодическиеОперацииСпособРасчетаГрафикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	Если Элементы.ПериодическиеОперации.ТекущиеДанные.ИспользованиеЗначения=ПредопределенноеЗначение("Перечисление.СпособыИспользованияЗначенияПериодическойОперации.ПериодическаяОперация") Тогда
		
		ОткрытьФорму("Справочник.СпособыРасчетаГрафиковПериодическихОпераций.ФормаВыбора",,Элемент);
		
	ИначеЕсли Элементы.ПериодическиеОперации.ТекущиеДанные.ИспользованиеЗначения=ПредопределенноеЗначение("Перечисление.СпособыИспользованияЗначенияПериодическойОперации.БазаДляРасчетаПериодическихОпераций") Тогда
		
		ОткрытьФорму("Справочник.СпособыРасчетаСуммПериодическихОпераций.ФормаВыбора",,Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодическиеОперацииИспользованиеЗначенияПриИзменении(Элемент)
	
	Элементы.ПериодическиеОперации.ТекущиеДанные.СпособРасчета="";
	
	Если Элементы.ПериодическиеОперации.ТекущиеДанные.ИспользованиеЗначения=ПредопределенноеЗначение("Перечисление.СпособыИспользованияЗначенияПериодическойОперации.РазоваяОперация") Тогда
		
		Элементы.ПериодическиеОперации.ТекущиеДанные.ДатаОкончания=Элементы.ПериодическиеОперации.ТекущиеДанные.ДатаНачала;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДоговоруКонтрагента()
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДоговорКонтрагента,"БанковскийСчет,БанковскийСчетКонтрагента");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ЗначенияРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ЗаполнитьПоДоговоруКонтрагента();

КонецПроцедуры
